Бывают аннотитрованный и с легковесный.
Легковесный просто указывает на коммит.
Example: git tag 1.0 "имя коммита" имя коммита можно опустить если на текущем. Далее можно узнать что за коммит командой git show 1.0.
Тэг вешается на коммит и позволяет быстро на него переключаться командой git checkout "имя тэга".
Аннотированные содержат инфу, такую же как при git commit -m " ВОТ ТУТ ПИШЕТСЯ АННОТАЦИЯ" на-р емэйл разраба. 
git tag -a 2.1 -m "predreliznaya versia"
Набрав git show 2.1 мы увидим сообщение, кто создал и в какое время.

git tag -d имя тэга удаляет любой тэг

Примерный порядок Добавления
git tag -a v1.40.2 -m "predreliznaya versia"
git push origin v1.40.2


Примерный порядок удаления
git tag -d v1.40.2
git push --delete origin v.1.40.2


